{
  "_class_name": "StableDiffusionPipeline",
  "_diffusers_version": "0.4.1",
  "feature_extractor": [
    "transformers",
    "CLIPFeatureExtractor"
  ],
  "safety_checker": [
    "stable_diffusion",
    "StableDiffusionSafetyChecker"
  ],
  "scheduler": [
    "diffusers",
<<<<<<< HEAD
    "LMSDiscreteScheduler"
=======
    "DDIMScheduler"
>>>>>>> b45bafccd9d0e0757b70a54c7ebc32ff56ca9ee1
  ],
  "text_encoder": [
    "transformers",
    "CLIPTextModel"
  ],
  "tokenizer": [
    "transformers",
    "CLIPTokenizer"
  ],
  "unet": [
    "diffusers",
    "UNet2DConditionModel"
  ],
  "vae": [
    "diffusers",
    "AutoencoderKL"
  ]
}
