{
  "_class_name": "AutoencoderKL",
<<<<<<< HEAD
  "_diffusers_version": "0.4.1",
=======
  "_diffusers_version": "0.2.4",
  "_name_or_path": "waifu-diffusion/vae",
>>>>>>> b45bafccd9d0e0757b70a54c7ebc32ff56ca9ee1
  "act_fn": "silu",
  "block_out_channels": [
    128,
    256,
    512,
    512
  ],
  "down_block_types": [
    "DownEncoderBlock2D",
    "DownEncoderBlock2D",
    "DownEncoderBlock2D",
    "DownEncoderBlock2D"
  ],
  "in_channels": 3,
  "latent_channels": 4,
  "layers_per_block": 2,
  "norm_num_groups": 32,
  "out_channels": 3,
  "sample_size": 256,
  "up_block_types": [
    "UpDecoderBlock2D",
    "UpDecoderBlock2D",
    "UpDecoderBlock2D",
    "UpDecoderBlock2D"
  ]
}
